In [1]:
#import the proper packages for python
import psycopg2
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Pass the connection string to a variable, conn_url
# Using group as the database 
conn_url = 'postgresql://postgres:2806218@localhost/group' 

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

In [3]:
#create the tables for schema 

stmt = """   
    
    CREATE TABLE customer_loyalty (
          customer_loyalty_id                       integer,
          loyalty_level                             integer,
          loyalty_level_name                        varchar(10) NOT NULL,
          PRIMARY KEY                               (customer_loyalty_id)
    );
    
    
     CREATE TABLE customers (
          customer_id                          integer,
          customer_first_name                  varchar(20)NOT NULL,
          customer_last_name                   varchar(20)NOT NULL,
          customer_loyalty_id                  integer NOT NULL,
          birth_year                           integer NOT NULL,
          education                            varchar(15),
          marital_status                       varchar(15),
          income                               numeric(12,2), 
          numberof_children                    numeric, 
          enrollment_date                      date NOT NULL, 
          complain                             boolean NOT NULL,
          PRIMARY KEY                          (customer_id), 
          FOREIGN KEY (customer_loyalty_id) references customer_loyalty(customer_loyalty_id)
    );


        CREATE TABLE customer_orders (
          order_id                                      integer,
          invoice_date                                  date NOT NULL,
          customer_id                                   integer NOT NULL,
          PRIMARY KEY                                   (order_id),
          FOREIGN KEY (customer_id) references          customers(customer_id)
    );
    
    CREATE TABLE payment_info (
          payment_id                                   integer,
          order_id                                     integer NOT NULL,
          payment_method                               varchar(30) NOT NULL, 
          payment_date                                 date NOT NULL,
          payment_total                                numeric(6,2) NOT NULL,
          PRIMARY KEY                                  (payment_id),
          FOREIGN KEY (order_id) references            customer_orders(order_id),
          CONSTRAINT order_payment_unique unique (order_id)
    );
    
        CREATE TABLE shipment_status (
          shipment_id                          integer,
          order_id                             integer NOT NULL,
          shipment_status                      varchar(30) NOT NULL, 
          shipment_date                        date,
          shipment_zipcode                     varchar(10) NOT NULL,
          delivery_date                        date,
          PRIMARY KEY                         (shipment_id),
          FOREIGN KEY (order_id) references    customer_orders(order_id),
          CONSTRAINT order_shipment_unique unique (order_id)
    );
        
         CREATE TABLE order_location (
          store_location_id                integer,
          order_id                         integer NOT NULL,
          store_street_address             varchar(50) NOT NULL,  
          store_state                      varchar(2) NOT NULL, 
          store_zipcode                    varchar(10) NOT NULL,    
          store_phone                      varchar(20),
          PRIMARY KEY                     (store_location_id),
          FOREIGN KEY (order_id) references    customer_orders(order_id),
          CONSTRAINT order_location_unique unique (order_id)

    );
           
        
        CREATE TABLE supplier_representative (
          representative_id                           integer,    
          representative_phone                        varchar(50) NOT NULL, 
          representative_email                        varchar(100) NOT NULL,
          representative_first_name                   varchar(20),
          representative_last_name                    varchar(20),
          PRIMARY KEY                                 (representative_id)
        
    );
    

        CREATE TABLE supplier_location (
          supplier_location_id                  integer,
          supplier_location_state               varchar(2) NOT NULL, 
          supplier_location_street              varchar(60) NOT NULL,
          PRIMARY KEY                           (supplier_location_id)
    );
    

        CREATE TABLE suppliers (
          supplier_id                                   integer,  
          representative_id                             integer,
          supplier_location_id                          integer NOT NULL,
          supplier_name                                 varchar(50) NOT NULL,
          supplier_start_date                           date NOT NULL,
          PRIMARY KEY                                   (supplier_id),
          FOREIGN KEY (representative_id) references    supplier_representative(representative_id),
          FOREIGN KEY (supplier_location_id) references supplier_location(supplier_location_id)        
    );
    
    
        CREATE TABLE ref_department (
          department_name                            varchar(30),
          PRIMARY KEY                               (department_name) 
    );  
    
    
        CREATE TABLE product (
          product_id                                integer, 
          department_name                           varchar(30) NOT NULL,
          product_type                              varchar(15) NOT NULL, 
          unit_price                                numeric(6,2) NOT NULL,
          product_quantity                          integer NOT NULL,
          PRIMARY KEY                               (product_id),
          FOREIGN KEY (department_name) references   ref_department(department_name)   
    );
    

        CREATE TABLE order_product (
          order_id                                  integer,
          product_id                                integer,
          quantity_in_order                         integer NOT NULL,
          PRIMARY KEY                               (order_id,product_id),
          FOREIGN KEY (order_id) references         customer_orders(order_id),
          FOREIGN KEY (product_id) references       product(product_id )    
    );


        CREATE TABLE product_suppliers (
          supplier_id                               integer,
          product_id                                integer, 
          PRIMARY KEY                               (supplier_id,product_id),
          FOREIGN KEY (supplier_id) references      suppliers(supplier_id),
          FOREIGN KEY (product_id) references       product(product_id )    
    );
    

        CREATE TABLE promotion (
          promotion_id                          integer,    
          promotion_name                        varchar(15) NOT NULL, 
          PRIMARY KEY                           (promotion_id)
    );
    

        CREATE TABLE promotion_recipes (
          recipe_id                                 integer,
          promotion_id                              integer,     
          time_of_day                               varchar(10) NOT NULL, 
          FOREIGN KEY (promotion_id) references     promotion(promotion_id),
          PRIMARY KEY                               (recipe_id)
    );


        CREATE TABLE product_promotion (
          promotion_id                               integer,
          product_id                                 integer, 
          PRIMARY KEY                                (promotion_id,product_id),
          FOREIGN KEY (promotion_id) references      promotion(promotion_id),
          FOREIGN KEY (product_id) references        product(product_id)    
    );
    
        
        CREATE TABLE customer_promotion (
          customer_id                               integer,
          promotion_id                              integer,   
          deals                                     numeric(6,2) NOT NULL, 
          response                                  boolean NOT NULL, 
          PRIMARY KEY                               (promotion_id,customer_id),
          FOREIGN KEY (promotion_id) references     promotion(promotion_id),
          FOREIGN KEY (customer_id) references      customers(customer_id)
    );    
    

"""

In [4]:
connection.execute(stmt)

In [5]:
#read csv file using pandas
df = pd.read_csv('marketing_campaign.csv')
#Converting strings to lowercase 
df.columns=df.columns.map(lambda x:x.lower())

#examine csv file using .head() and look at all the columns using .info() to ensure there are no NULL values
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 42 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer_first_name        2240 non-null   object
 1   customer_last_name         2240 non-null   object
 2   order_id                   2240 non-null   int64
 3   loyalty_level_name         2240 non-null   object
 4   loyalty_level              2240 non-null   int64
 5   payment_method             2240 non-null   object
 6   payment_date               2240 non-null   object
 7   store_street_address       2240 non-null   object
 8   store_state                2240 non-null   object
 9   store_zipcode              2240 non-null   int64
 10  store_phone                2240 non-null   object
 11  shipment_status            2240 non-null   object
 12  delivery_date              1982 non-null   object
 13  shipment_date              2240 non-null   object
 14  shipment_zipcode           2240 non-null   int64
 15  payment_total              2240 non-null   int64
 16  invoice_date               2240 non-null   object
 17  representative_phone       2240 non-null   object
 18  representative_email       2240 non-null   object
 19  representative_first_name  2240 non-null   object
 20  representative_last_name   2240 non-null   object
 21  supplier_name              2240 non-null   object
 22  supplier_start_date        2240 non-null   object
 23  supplier_location_state    2240 non-null   object
 24  supplier_location_street   2240 non-null   object
 25  department_name            2240 non-null   object
 26  product_type               2240 non-null   object
 27  product_quantity           2240 non-null   int64
 28  unit_price                 2240 non-null   float64
 29  quantity_in_order          2240 non-null   int64
 30  time_of_day                2240 non-null   object
 31  promotion_name             2240 non-null   object
 32  promotion_response         2240 non-null   int64
 33  birth_year                 2240 non-null   int64
 34  education                  2240 non-null   object
 35  marital_status             2240 non-null   object
 36  income                     2216 non-null   float64
 37  numberof_children          2240 non-null   int64
 38  enrollment_date            2240 non-null   object
 39  complain                   2240 non-null   int64
 40  response                   2240 non-null   int64
 41  deals                      2240 non-null   int64
dtypes: float64(2), int64(13), object(27)
memory usage: 735.1+ KB

In [6]:
df.head()

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,promotion_response,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals
0,Muhammed,Macintyre,1,Bronze,3,credit card,6/26/2022,4 Union Square S,NY,10003,...,1,1957,Graduation,Single,58138.0,0,4/9/2012,0,1,3
1,Barry,French,2,Bronze,3,venmo,3/20/2022,3720 Vision Dr,TX,76109,...,0,1954,Graduation,Single,46344.0,2,8/3/2014,0,0,2
2,Clay,Rozendal,3,Bronze,3,venmo,6/4/2022,788 S Grand Ave,CA,90017,...,0,1965,Graduation,Together,71613.0,0,21-08-2013,0,0,1
3,Carlos,Soltero,4,Bronze,3,cash,1/4/2022,5118 S Lake Park Ave,IL,60615,...,0,1984,Graduation,Together,26646.0,1,10/2/2014,0,0,2
4,Carl,Jackson,5,Bronze,3,cash,7/1/2022,7930 SW 104th St,FL,33156,...,0,1981,PhD,Married,58293.0,1,19-01-2014,0,0,5

### create customer_loyalty table

In [7]:
# Create temporary dataframe with unique customer_loyalty
customer_loyalty_df = df[['loyalty_level','loyalty_level_name']].drop_duplicates()
# Add incrementing integers
customer_loyalty_df.insert(0, 'customer_loyalty_id', range(1, 1 + len(customer_loyalty_df)))
customer_loyalty_df

    customer_loyalty_id  loyalty_level loyalty_level_name
0                     1              3             Bronze
15                    2              2             Silver
77                    3              1               Gold

In [8]:
#Load customer_loyalty data in the postgresql database
customer_loyalty_df.to_sql(name='customer_loyalty', con=engine, if_exists='append', index=False)

### create customers table

In [9]:
import datetime
#cleaning customer_date column for python to recognize date
df['enrollment_date'] = pd.to_datetime(df.enrollment_date)

In [10]:
#view cleaned date
df['enrollment_date']

0      2012-04-09
1      2014-08-03
2      2013-08-21
3      2014-10-02
4      2014-01-19
          ...
2235   2013-06-13
2236   2014-10-06
2237   2014-01-25
2238   2014-01-24
2239   2012-10-15
Name: enrollment_date, Length: 2240, dtype: datetime64[ns]

In [11]:
#Make the Complain column boolean
df['complain'] = df['complain'].astype('bool')

In [12]:
#merge customer_loyalty_id
customer_df1 = pd.merge(df,customer_loyalty_df,how='left',on=['loyalty_level','loyalty_level_name'])
customer_df1

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,customer_loyalty_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,6/26/2022,4 Union Square S,NY,10003,...,1957,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1
1,Barry,French,2,Bronze,3,venmo,3/20/2022,3720 Vision Dr,TX,76109,...,1954,Graduation,Single,46344.0,2,2014-08-03,False,0,2,1
2,Clay,Rozendal,3,Bronze,3,venmo,6/4/2022,788 S Grand Ave,CA,90017,...,1965,Graduation,Together,71613.0,0,2013-08-21,False,0,1,1
3,Carlos,Soltero,4,Bronze,3,cash,1/4/2022,5118 S Lake Park Ave,IL,60615,...,1984,Graduation,Together,26646.0,1,2014-10-02,False,0,2,1
4,Carl,Jackson,5,Bronze,3,cash,7/1/2022,7930 SW 104th St,FL,33156,...,1981,PhD,Married,58293.0,1,2014-01-19,False,0,5,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,3/7/2022,7930 SW 104th St,FL,33156,...,1967,Graduation,Married,61223.0,1,2013-06-13,True,0,1,2
2236,Jim,Epp,2237,Bronze,3,check,7/8/2022,7930 SW 104th St,FL,33156,...,1946,PhD,Together,64014.0,3,2014-10-06,True,0,1,1
2237,Jose,Mccloud,2238,Bronze,3,cash,1/8/2022,7930 SW 104th St,FL,33156,...,1981,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,1
2238,Kingston,Vasquez,2239,Bronze,3,debit card,1/17/2022,7930 SW 104th St,FL,33156,...,1956,Master,Together,69245.0,1,2014-01-24,True,1,4,1
2239,Dylan,Walker,2240,Bronze,3,credit card,2/3/2022,7930 SW 104th St,FL,33156,...,1954,PhD,Married,52869.0,2,2012-10-15,True,1,1,1

In [13]:
#create the customers table
customers_df = df.dropna()
customers_df = customer_df1[['customer_loyalty_id', 'customer_first_name','customer_last_name','birth_year', 'education', 'marital_status', 'income','numberof_children','enrollment_date', 'complain']].drop_duplicates()
customers_df.insert(0, 'customer_id', range(1, 1 + len(customers_df)))
customers_df

,customer_id,customer_loyalty_id,customer_first_name,customer_last_name,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain
0,1,1,Muhammed,Macintyre,1957,Graduation,Single,58138.0,0,2012-04-09,False
1,2,1,Barry,French,1954,Graduation,Single,46344.0,2,2014-08-03,False
2,3,1,Clay,Rozendal,1965,Graduation,Together,71613.0,0,2013-08-21,False
3,4,1,Carlos,Soltero,1984,Graduation,Together,26646.0,1,2014-10-02,False
4,5,1,Carl,Jackson,1981,PhD,Married,58293.0,1,2014-01-19,False
...,...,...,...,...,...,...,...,...,...,...,...
2235,2126,2,Alyson,Brown,1967,Graduation,Married,61223.0,1,2013-06-13,True
2236,2127,1,Jim,Epp,1946,PhD,Together,64014.0,3,2014-10-06,True
2237,2128,1,Jose,Mccloud,1981,Graduation,Divorced,56981.0,0,2014-01-25,True
2238,2129,1,Kingston,Vasquez,1956,Master,Together,69245.0,1,2014-01-24,True
2239,2130,1,Dylan,Walker,1954,PhD,Married,52869.0,2,2012-10-15,True

In [14]:
#Load customer data in the postgresql database
customers_df.to_sql(name='customers', con=engine, if_exists='append', index=False)

### create customer_orders table

In [15]:
#cleaning payment_info column for python to recognize date
df['invoice_date'] = pd.to_datetime(df.invoice_date)

In [16]:
#cutomer_orders to customers many_to_one
customers_temp = pd.merge(df,customers_df,how='left',on=['customer_first_name','customer_last_name','birth_year','education', 'marital_status', 'income','numberof_children','enrollment_date','complain'])
customers_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,customer_id,customer_loyalty_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,6/26/2022,4 Union Square S,NY,10003,...,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1,1
1,Barry,French,2,Bronze,3,venmo,3/20/2022,3720 Vision Dr,TX,76109,...,Graduation,Single,46344.0,2,2014-08-03,False,0,2,2,1
2,Clay,Rozendal,3,Bronze,3,venmo,6/4/2022,788 S Grand Ave,CA,90017,...,Graduation,Together,71613.0,0,2013-08-21,False,0,1,3,1
3,Carlos,Soltero,4,Bronze,3,cash,1/4/2022,5118 S Lake Park Ave,IL,60615,...,Graduation,Together,26646.0,1,2014-10-02,False,0,2,4,1
4,Carl,Jackson,5,Bronze,3,cash,7/1/2022,7930 SW 104th St,FL,33156,...,PhD,Married,58293.0,1,2014-01-19,False,0,5,5,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,3/7/2022,7930 SW 104th St,FL,33156,...,Graduation,Married,61223.0,1,2013-06-13,True,0,1,2126,2
2236,Jim,Epp,2237,Bronze,3,check,7/8/2022,7930 SW 104th St,FL,33156,...,PhD,Together,64014.0,3,2014-10-06,True,0,1,2127,1
2237,Jose,Mccloud,2238,Bronze,3,cash,1/8/2022,7930 SW 104th St,FL,33156,...,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,2128,1
2238,Kingston,Vasquez,2239,Bronze,3,debit card,1/17/2022,7930 SW 104th St,FL,33156,...,Master,Together,69245.0,1,2014-01-24,True,1,4,2129,1
2239,Dylan,Walker,2240,Bronze,3,credit card,2/3/2022,7930 SW 104th St,FL,33156,...,PhD,Married,52869.0,2,2012-10-15,True,1,1,2130,1

In [17]:
# Create temporary dataframe with unique customer_orders
customer_orders_df = customers_temp[['order_id','invoice_date','customer_id']].drop_duplicates()
# Add incrementing integers
customer_orders_df

      order_id invoice_date  customer_id
0            1   2022-07-01            1
1            2   2022-03-25            2
2            3   2022-06-09            3
3            4   2022-01-09            4
4            5   2022-07-06            5
...        ...          ...          ...
2235      2236   2022-03-12         2126
2236      2237   2022-07-13         2127
2237      2238   2022-01-13         2128
2238      2239   2022-01-22         2129
2239      2240   2022-02-08         2130

[2240 rows x 3 columns]

In [18]:
#Load customer_orders data in the postgresql database
customer_orders_df.to_sql(name='customer_orders', con=engine, if_exists='append', index=False)

### create shipment_status table

In [19]:
import datetime
#cleaning shipment_status column for python to recognize date
df['shipment_date'] = pd.to_datetime(df.shipment_date)
df['delivery_date'] = pd.to_datetime(df.delivery_date)

In [20]:
#merge order_id into shipment_status, one to one relationship
shipment_status_temp = pd.merge(df,customer_orders_df,how='left',on=['order_id','invoice_date'])
shipment_status_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,customer_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,6/26/2022,4 Union Square S,NY,10003,...,1957,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1
1,Barry,French,2,Bronze,3,venmo,3/20/2022,3720 Vision Dr,TX,76109,...,1954,Graduation,Single,46344.0,2,2014-08-03,False,0,2,2
2,Clay,Rozendal,3,Bronze,3,venmo,6/4/2022,788 S Grand Ave,CA,90017,...,1965,Graduation,Together,71613.0,0,2013-08-21,False,0,1,3
3,Carlos,Soltero,4,Bronze,3,cash,1/4/2022,5118 S Lake Park Ave,IL,60615,...,1984,Graduation,Together,26646.0,1,2014-10-02,False,0,2,4
4,Carl,Jackson,5,Bronze,3,cash,7/1/2022,7930 SW 104th St,FL,33156,...,1981,PhD,Married,58293.0,1,2014-01-19,False,0,5,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,3/7/2022,7930 SW 104th St,FL,33156,...,1967,Graduation,Married,61223.0,1,2013-06-13,True,0,1,2126
2236,Jim,Epp,2237,Bronze,3,check,7/8/2022,7930 SW 104th St,FL,33156,...,1946,PhD,Together,64014.0,3,2014-10-06,True,0,1,2127
2237,Jose,Mccloud,2238,Bronze,3,cash,1/8/2022,7930 SW 104th St,FL,33156,...,1981,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,2128
2238,Kingston,Vasquez,2239,Bronze,3,debit card,1/17/2022,7930 SW 104th St,FL,33156,...,1956,Master,Together,69245.0,1,2014-01-24,True,1,4,2129
2239,Dylan,Walker,2240,Bronze,3,credit card,2/3/2022,7930 SW 104th St,FL,33156,...,1954,PhD,Married,52869.0,2,2012-10-15,True,1,1,2130

In [21]:
# Create temporary dataframe with unique shipment_status
shipment_status_df = shipment_status_temp[['shipment_status','delivery_date','shipment_date','shipment_zipcode','order_id']].drop_duplicates()
# Add incrementing integers
shipment_status_df.insert(0, 'shipment_id', range(1, 1 + len(shipment_status_df)))
shipment_status_df

,shipment_id,shipment_status,delivery_date,shipment_date,shipment_zipcode,order_id
0,1,Delivered,2022-06-30,2022-06-29,10003,1
1,2,Delivered,2022-03-24,2022-03-23,76110,2
2,3,Delivered,2022-06-08,2022-06-07,90020,3
3,4,Delivered,2022-01-08,2022-01-07,60625,4
4,5,Out For Delivery,NaT,2022-07-04,33170,5
...,...,...,...,...,...,...
2235,2236,Delivered,2022-03-11,2022-03-10,33170,2236
2236,2237,Out For Delivery,NaT,2022-07-11,33170,2237
2237,2238,Delivered,2022-01-12,2022-01-11,33170,2238
2238,2239,Delivered,2022-01-21,2022-01-20,33170,2239
2239,2240,Delivered,2022-02-07,2022-02-06,33170,2240

In [22]:
#Load shipment_status data in the postgresql database
shipment_status_df.to_sql(name='shipment_status', con=engine, if_exists='append', index=False)

### create order_location table

In [23]:
#merge order_id into order_location,one to one relationship
order_location_temp = pd.merge(df,customer_orders_df,how='left',on=['order_id','invoice_date'])
order_location_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,customer_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,6/26/2022,4 Union Square S,NY,10003,...,1957,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1
1,Barry,French,2,Bronze,3,venmo,3/20/2022,3720 Vision Dr,TX,76109,...,1954,Graduation,Single,46344.0,2,2014-08-03,False,0,2,2
2,Clay,Rozendal,3,Bronze,3,venmo,6/4/2022,788 S Grand Ave,CA,90017,...,1965,Graduation,Together,71613.0,0,2013-08-21,False,0,1,3
3,Carlos,Soltero,4,Bronze,3,cash,1/4/2022,5118 S Lake Park Ave,IL,60615,...,1984,Graduation,Together,26646.0,1,2014-10-02,False,0,2,4
4,Carl,Jackson,5,Bronze,3,cash,7/1/2022,7930 SW 104th St,FL,33156,...,1981,PhD,Married,58293.0,1,2014-01-19,False,0,5,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,3/7/2022,7930 SW 104th St,FL,33156,...,1967,Graduation,Married,61223.0,1,2013-06-13,True,0,1,2126
2236,Jim,Epp,2237,Bronze,3,check,7/8/2022,7930 SW 104th St,FL,33156,...,1946,PhD,Together,64014.0,3,2014-10-06,True,0,1,2127
2237,Jose,Mccloud,2238,Bronze,3,cash,1/8/2022,7930 SW 104th St,FL,33156,...,1981,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,2128
2238,Kingston,Vasquez,2239,Bronze,3,debit card,1/17/2022,7930 SW 104th St,FL,33156,...,1956,Master,Together,69245.0,1,2014-01-24,True,1,4,2129
2239,Dylan,Walker,2240,Bronze,3,credit card,2/3/2022,7930 SW 104th St,FL,33156,...,1954,PhD,Married,52869.0,2,2012-10-15,True,1,1,2130

In [24]:
# Create temporary dataframe with unique order_location
order_location_df = order_location_temp[['order_id','store_street_address','store_state','store_zipcode','store_phone']].drop_duplicates()
# Add incrementing integers
order_location_df.insert(0, 'store_location_id', range(1, 1 + len(order_location_df)))
order_location_df

,store_location_id,order_id,store_street_address,store_state,store_zipcode,store_phone
0,1,1,4 Union Square S,NY,10003,212-673-5388
1,2,2,3720 Vision Dr,TX,76109,682-316-8040
2,3,3,788 S Grand Ave,CA,90017,213-873-4745
3,4,4,5118 S Lake Park Ave,IL,60615,773-819-1600
4,5,5,7930 SW 104th St,FL,33156,305-969-5800
...,...,...,...,...,...,...
2235,2236,2236,7930 SW 104th St,FL,33156,305-969-5800
2236,2237,2237,7930 SW 104th St,FL,33156,305-969-5800
2237,2238,2238,7930 SW 104th St,FL,33156,305-969-5800
2238,2239,2239,7930 SW 104th St,FL,33156,305-969-5800
2239,2240,2240,7930 SW 104th St,FL,33156,305-969-5800

In [25]:
#Load order_location data in the postgresql database
order_location_df.to_sql(name='order_location', con=engine, if_exists='append', index=False)

### create payment_info table

In [26]:
import datetime
#cleaning payment_info column for python to recognize date
df['payment_date'] = pd.to_datetime(df.payment_date)
#view cleaned date
df['payment_date']

0      2022-06-26
1      2022-03-20
2      2022-06-04
3      2022-01-04
4      2022-07-01
          ...
2235   2022-03-07
2236   2022-07-08
2237   2022-01-08
2238   2022-01-17
2239   2022-02-03
Name: payment_date, Length: 2240, dtype: datetime64[ns]

In [27]:
#merge order_id into payment_info,one to one relationship
payment_info_temp = pd.merge(df,customer_orders_df,how='left',on=['order_id','invoice_date'])
payment_info_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,customer_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,1957,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,1954,Graduation,Single,46344.0,2,2014-08-03,False,0,2,2
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,1965,Graduation,Together,71613.0,0,2013-08-21,False,0,1,3
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,1984,Graduation,Together,26646.0,1,2014-10-02,False,0,2,4
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,1981,PhD,Married,58293.0,1,2014-01-19,False,0,5,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,1967,Graduation,Married,61223.0,1,2013-06-13,True,0,1,2126
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,1946,PhD,Together,64014.0,3,2014-10-06,True,0,1,2127
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,1981,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,2128
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,1956,Master,Together,69245.0,1,2014-01-24,True,1,4,2129
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,1954,PhD,Married,52869.0,2,2012-10-15,True,1,1,2130

In [28]:
# Create temporary dataframe with unique payment_info
payment_info_df = payment_info_temp[['order_id','payment_method','payment_date','payment_total']].drop_duplicates()
# Add incrementing integers
payment_info_df.insert(0, 'payment_id', range(1, 1 + len(payment_info_df)))
payment_info_df

      payment_id  order_id payment_method payment_date  payment_total
0              1         1    credit card   2022-06-26            362
1              2         2          venmo   2022-03-20            335
2              3         3          venmo   2022-06-04            283
3              4         4           cash   2022-01-04            412
4              5         5           cash   2022-07-01            264
...          ...       ...            ...          ...            ...
2235        2236      2236    credit card   2022-03-07            101
2236        2237      2237          check   2022-07-08            234
2237        2238      2238           cash   2022-01-08            126
2238        2239      2239     debit card   2022-01-17            283
2239        2240      2240    credit card   2022-02-03            322

[2240 rows x 5 columns]

In [29]:
#Load payment_info data in the postgresql database
payment_info_df.to_sql(name='payment_info', con=engine, if_exists='append', index=False)

### create supplier_representative table

In [30]:
# Create temporary dataframe with unique supplier_representative
supplier_representative_df = df[['representative_phone','representative_email','representative_first_name','representative_last_name']].drop_duplicates()
# Add incrementing integers
supplier_representative_df.insert(0, 'representative_id', range(1, 1 + len(supplier_representative_df)))
supplier_representative_df.head()

,representative_id,representative_phone,representative_email,representative_first_name,representative_last_name
0,1,829-171-9108,Mary.Olson@gmail.com,Mary,Olson
1,2,455-025-7864,Mary.Smith@outlook.com,Mary,Smith
4,3,405-437-1466,Brynne.Giles@gmail.com,Brynne,Giles
5,4,440-604-6440,Johnny.Smith@yahoo.com,Johnny,Smith
6,5,506-956-0578,Mary.Frank@inbox.com,Mary,Frank

In [31]:
#Load supplier_representative data in the postgresql database
supplier_representative_df.to_sql(name='supplier_representative', con=engine, if_exists='append', index=False)

### create supplier_location table

In [32]:
# Create temporary dataframe with unique supplier_location
supplier_location_df = df[['supplier_location_street','supplier_location_state']].drop_duplicates()
# Add incrementing integers
supplier_location_df.insert(0, 'supplier_location_id', range(1, 1 + len(supplier_location_df)))
supplier_location_df

     supplier_location_id supplier_location_street supplier_location_state
0                       1       221 Ligontown Road                      VA
1                       2      W7402 Fox Trail Rd.                      WI
2                       3    33 Bartlett Farm Road                      MA
3                       4   3275 Cold Springs Road                      NY
4                       5       1146 NE Madison Rd                      WA
..                    ...                      ...                     ...
267                    62    5985 S.W. Anglin Road                      AR
305                    63        3261 Endsley Road                      FL
316                    64            310 Kunkle Rd                      PA
317                    65      5095 Thoms Run Road                      PA
403                    66        12456 Bagley Ave.                      MN

[66 rows x 3 columns]

In [33]:
#Load supplier_location data in the postgresql database
supplier_location_df.to_sql(name='supplier_location', con=engine, if_exists='append', index=False)

### create suppliers table

In [34]:
#cleaning suppliers column for python to recognize date
df['supplier_start_date'] = pd.to_datetime(df.supplier_start_date)
# one to many relationship to supplier_representative 
representative_temp = pd.merge(df,supplier_representative_df,how='left',on=['representative_phone','representative_email','representative_first_name','representative_last_name'])
representative_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,representative_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,1957,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,1954,Graduation,Single,46344.0,2,2014-08-03,False,0,2,2
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,1965,Graduation,Together,71613.0,0,2013-08-21,False,0,1,2
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,1984,Graduation,Together,26646.0,1,2014-10-02,False,0,2,2
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,1981,PhD,Married,58293.0,1,2014-01-19,False,0,5,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,1967,Graduation,Married,61223.0,1,2013-06-13,True,0,1,24
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,1946,PhD,Together,64014.0,3,2014-10-06,True,0,1,4
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,1981,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,46
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,1956,Master,Together,69245.0,1,2014-01-24,True,1,4,49
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,1954,PhD,Married,52869.0,2,2012-10-15,True,1,1,3

In [35]:
# one to many relationship to supplier_location 
supplier_location_temp = pd.merge(representative_temp,supplier_location_df,how='left',on=['supplier_location_state','supplier_location_street'])
supplier_location_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,representative_id,supplier_location_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1,1
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,Graduation,Single,46344.0,2,2014-08-03,False,0,2,2,2
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,Graduation,Together,71613.0,0,2013-08-21,False,0,1,2,3
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,Graduation,Together,26646.0,1,2014-10-02,False,0,2,2,4
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,PhD,Married,58293.0,1,2014-01-19,False,0,5,3,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,Graduation,Married,61223.0,1,2013-06-13,True,0,1,24,29
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,PhD,Together,64014.0,3,2014-10-06,True,0,1,4,6
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,46,51
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,Master,Together,69245.0,1,2014-01-24,True,1,4,49,54
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,PhD,Married,52869.0,2,2012-10-15,True,1,1,3,5

In [36]:
# Create temporary dataframe with unique suppliers
suppliers_df = supplier_location_temp[['representative_id','supplier_location_id','supplier_name','supplier_start_date']].drop_duplicates()
# Add incrementing integers
suppliers_df.insert(0, 'supplier_id', range(1, 1 + len(suppliers_df)))
suppliers_df

,supplier_id,representative_id,supplier_location_id,supplier_name,supplier_start_date
0,1,1,1,Devon Point Farm,2015-01-27
1,2,2,2,Hemingway Farms,2014-07-28
2,3,2,3,Enviro Worm Gardening,2014-09-16
3,4,2,4,RB Pop Up Farm Stand,2016-07-17
4,5,3,5,Fruit Ridge Hayrides LLC,2015-04-04
...,...,...,...,...,...
267,64,55,62,Hattie Carthan After Church Farmers Market,2016-06-13
305,65,56,63,Adoni Arces Family Farm LLC,2014-07-27
316,66,57,64,Brenckle's Organic Farm & Greenhouse,2014-09-15
317,67,2,65,Joseph's Grainery,2014-07-28
403,68,58,66,Hurricane Creek Farms,2014-09-16

In [37]:
#Load suppliers data in the postgresql database
suppliers_df.to_sql(name='suppliers', con=engine, if_exists='append', index=False)

### create ref_department table

In [38]:
# Create temporary dataframe with unique ref_department
department_df = df[['department_name']].drop_duplicates()
department_df.head()

   department_name
0          Produce
2  Non Perishables
6         Beverage

In [39]:
#Load ref_department data in the postgresql database
department_df.to_sql(name='ref_department', con=engine, if_exists='append', index=False)

### create product table

In [40]:
# many to one relationship to ref_department table
depart_temp = pd.merge(df,department_df,how='left',on='department_name')
depart_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,promotion_response,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,1,1957,Graduation,Single,58138.0,0,2012-04-09,False,1,3
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,0,1954,Graduation,Single,46344.0,2,2014-08-03,False,0,2
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,0,1965,Graduation,Together,71613.0,0,2013-08-21,False,0,1
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,0,1984,Graduation,Together,26646.0,1,2014-10-02,False,0,2
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,0,1981,PhD,Married,58293.0,1,2014-01-19,False,0,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,0,1967,Graduation,Married,61223.0,1,2013-06-13,True,0,1
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,1,1946,PhD,Together,64014.0,3,2014-10-06,True,0,1
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,1,1981,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,0,1956,Master,Together,69245.0,1,2014-01-24,True,1,4
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,1,1954,PhD,Married,52869.0,2,2012-10-15,True,1,1

In [41]:
# Create temporary dataframe with unique product
product_df = depart_temp[['department_name','product_type','unit_price','product_quantity']].drop_duplicates()
# Add incrementing integers
product_df.insert(0, 'product_id', range(1, 1 + len(product_df)))
product_df

   product_id  department_name product_type  unit_price  product_quantity
0           1          Produce         Fish       10.99             69000
1           2          Produce        Meats        5.67             69752
2           3  Non Perishables        Sweet        3.89             68059
6           4         Beverage         Wine       15.69             68942
7           5          Produce       Fruits        8.99             68931

In [42]:
#Load product data in the postgresql database
product_df.to_sql(name='product', con=engine, if_exists='append', index=False)

### create  order_product table

In [43]:
# merge prodcut_id into df
order_prodcut_temp = pd.merge(df,product_df,how='left',on=['product_type','unit_price','product_quantity'])
order_prodcut_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,product_id,department_name_y
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1,Produce
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,Graduation,Single,46344.0,2,2014-08-03,False,0,2,2,Produce
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,Graduation,Together,71613.0,0,2013-08-21,False,0,1,3,Non Perishables
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,Graduation,Together,26646.0,1,2014-10-02,False,0,2,2,Produce
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,PhD,Married,58293.0,1,2014-01-19,False,0,5,2,Produce
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,Graduation,Married,61223.0,1,2013-06-13,True,0,1,4,Beverage
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,PhD,Together,64014.0,3,2014-10-06,True,0,1,4,Beverage
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,2,Produce
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,Master,Together,69245.0,1,2014-01-24,True,1,4,3,Non Perishables
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,PhD,Married,52869.0,2,2012-10-15,True,1,1,5,Produce

In [44]:
# Create temporary dataframe with unique order_product
order_product_df = order_prodcut_temp[['product_id','order_id','quantity_in_order']].drop_duplicates()
order_product_df

      product_id  order_id  quantity_in_order
0              1         1                 38
1              2         2                 47
2              3         3                 22
3              2         4                 50
4              2         5                 19
...          ...       ...                ...
2235           4      2236                 40
2236           4      2237                 11
2237           2      2238                 38
2238           3      2239                 10
2239           5      2240                 22

[2240 rows x 3 columns]

In [45]:
#Load order_product data in the postgresql database
order_product_df.to_sql(name='order_product', con=engine, if_exists='append', index=False)

### create product_suppliers table

In [46]:
# merge prodcut_id into df
ps_temp = pd.merge(df,product_df,how='left',on=['product_type','unit_price','product_quantity'])
ps_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,product_id,department_name_y
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1,Produce
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,Graduation,Single,46344.0,2,2014-08-03,False,0,2,2,Produce
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,Graduation,Together,71613.0,0,2013-08-21,False,0,1,3,Non Perishables
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,Graduation,Together,26646.0,1,2014-10-02,False,0,2,2,Produce
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,PhD,Married,58293.0,1,2014-01-19,False,0,5,2,Produce
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,Graduation,Married,61223.0,1,2013-06-13,True,0,1,4,Beverage
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,PhD,Together,64014.0,3,2014-10-06,True,0,1,4,Beverage
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,2,Produce
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,Master,Together,69245.0,1,2014-01-24,True,1,4,3,Non Perishables
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,PhD,Married,52869.0,2,2012-10-15,True,1,1,5,Produce

In [47]:
# merge suppliers_id into df
ps1_temp = pd.merge(ps_temp,suppliers_df,how='left',on=['supplier_name','supplier_start_date'])
ps1_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,numberof_children,enrollment_date,complain,response,deals,product_id,department_name_y,supplier_id,representative_id,supplier_location_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,0,2012-04-09,False,1,3,1,Produce,1,1,1
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,2,2014-08-03,False,0,2,2,Produce,2,2,2
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,0,2013-08-21,False,0,1,3,Non Perishables,3,2,3
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,1,2014-10-02,False,0,2,2,Produce,4,2,4
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,1,2014-01-19,False,0,5,2,Produce,5,3,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,1,2013-06-13,True,0,1,4,Beverage,29,24,29
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,3,2014-10-06,True,0,1,4,Beverage,6,4,6
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,0,2014-01-25,True,1,1,2,Produce,52,46,51
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,1,2014-01-24,True,1,4,3,Non Perishables,55,49,54
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,2,2012-10-15,True,1,1,5,Produce,5,3,5

In [48]:
# Create temporary dataframe with unique product_suppliers
product_suppliers_df = ps1_temp[['supplier_id','product_id']].drop_duplicates()
product_suppliers_df

      supplier_id  product_id
0               1           1
1               2           2
2               3           3
3               4           2
4               5           2
...           ...         ...
1559           68           1
1764           65           2
1843           49           5
1962           62           5
2031           10           3

[337 rows x 2 columns]

In [49]:
#Load product_suppliers data in the postgresql database
product_suppliers_df.to_sql(name='product_suppliers', con=engine, if_exists='append', index=False)

### create promotion table

In [50]:
#Make the promotion_response column boolean
df['promotion_response'] = df['promotion_response'].astype('bool')

In [51]:
# Create temporary dataframe with unique promotion
promotion_df = df[['promotion_name']].drop_duplicates()
# Add incrementing integers
promotion_df.insert(0, 'promotion_id', range(1, 1 + len(promotion_df)))
promotion_df

    promotion_id promotion_name
0              1     Campaign 5
2              2     Campaign 3
4              3     Campaign 2
10             4     Campaign 4
11             5     Campaign 1

In [52]:
#Load promotion data in the postgresql database
promotion_df.to_sql(name='promotion', con=engine, if_exists='append', index=False)

### create promotion_recipes table

In [53]:
# many to one relationship to promotion table
receipes_temp = pd.merge(df,promotion_df,how='left',on=['promotion_name'])
receipes_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,promotion_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,1957,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,1954,Graduation,Single,46344.0,2,2014-08-03,False,0,2,1
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,1965,Graduation,Together,71613.0,0,2013-08-21,False,0,1,2
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,1984,Graduation,Together,26646.0,1,2014-10-02,False,0,2,1
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,1981,PhD,Married,58293.0,1,2014-01-19,False,0,5,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,1967,Graduation,Married,61223.0,1,2013-06-13,True,0,1,2
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,1946,PhD,Together,64014.0,3,2014-10-06,True,0,1,5
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,1981,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,1
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,1956,Master,Together,69245.0,1,2014-01-24,True,1,4,3
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,1954,PhD,Married,52869.0,2,2012-10-15,True,1,1,2

In [54]:
# Create temporary dataframe with unique promotion_recipes
promotion_recipes_df = receipes_temp[['time_of_day','promotion_id']].drop_duplicates()
# Add incrementing integers
promotion_recipes_df.insert(0, 'recipe_id', range(1, 1 + len(promotion_recipes_df)))
promotion_recipes_df

    recipe_id time_of_day  promotion_id
0           1       Drink             1
1           2       Lunch             1
2           3   Breakfast             2
4           4       Drink             3
5           5      Dinner             2
6           6       Snack             2
8           7       Snack             3
9           8       Lunch             3
10          9       Snack             4
11         10       Snack             5
12         11       Snack             1
16         12      Dinner             4
18         13       Lunch             5
20         14       Lunch             4
21         15       Drink             5
22         16   Breakfast             5
24         17       Drink             2
31         18       Drink             4
37         19   Breakfast             3
39         20   Breakfast             4
43         21      Dinner             1
48         22      Dinner             3
58         23      Dinner             5
68         24   Breakfast             1
70         25       Lunch             2

In [55]:
#Load promotion_recipes data in the postgresql database
promotion_recipes_df.to_sql(name='promotion_recipes', con=engine, if_exists='append', index=False)

### create product_promotion table

In [56]:
#merge product into df
pp_temp = pd.merge(df,product_df,how='left',on=['product_type','unit_price','product_quantity'])
pp_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,product_id,department_name_y
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,Graduation,Single,58138.0,0,2012-04-09,False,1,3,1,Produce
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,Graduation,Single,46344.0,2,2014-08-03,False,0,2,2,Produce
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,Graduation,Together,71613.0,0,2013-08-21,False,0,1,3,Non Perishables
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,Graduation,Together,26646.0,1,2014-10-02,False,0,2,2,Produce
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,PhD,Married,58293.0,1,2014-01-19,False,0,5,2,Produce
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,Graduation,Married,61223.0,1,2013-06-13,True,0,1,4,Beverage
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,PhD,Together,64014.0,3,2014-10-06,True,0,1,4,Beverage
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,Graduation,Divorced,56981.0,0,2014-01-25,True,1,1,2,Produce
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,Master,Together,69245.0,1,2014-01-24,True,1,4,3,Non Perishables
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,PhD,Married,52869.0,2,2012-10-15,True,1,1,5,Produce

In [57]:
# merge promotion into df
pp1_temp = pd.merge(pp_temp,promotion_df,how='left',on=['promotion_name'])
pp1_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,marital_status,income,numberof_children,enrollment_date,complain,response,deals,product_id,department_name_y,promotion_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,Single,58138.0,0,2012-04-09,False,1,3,1,Produce,1
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,Single,46344.0,2,2014-08-03,False,0,2,2,Produce,1
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,Together,71613.0,0,2013-08-21,False,0,1,3,Non Perishables,2
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,Together,26646.0,1,2014-10-02,False,0,2,2,Produce,1
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,Married,58293.0,1,2014-01-19,False,0,5,2,Produce,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,Married,61223.0,1,2013-06-13,True,0,1,4,Beverage,2
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,Together,64014.0,3,2014-10-06,True,0,1,4,Beverage,5
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,Divorced,56981.0,0,2014-01-25,True,1,1,2,Produce,1
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,Together,69245.0,1,2014-01-24,True,1,4,3,Non Perishables,3
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,Married,52869.0,2,2012-10-15,True,1,1,5,Produce,2

In [58]:
# Create temporary dataframe with unique product_promotion
product_promotion_df = pp1_temp[['promotion_id','product_id']].drop_duplicates()
product_promotion_df

    promotion_id  product_id
0              1           1
1              1           2
2              2           3
4              3           2
5              2           2
6              2           4
7              2           5
8              3           5
10             4           4
11             5           2
12             1           3
14             5           5
15             3           3
17             3           4
22             5           3
23             5           4
27             4           2
29             4           3
30             4           1
39             4           5
45             5           1
49             3           1
59             2           1
75             1           4
97             1           5

In [59]:
#Load product_promotion data in the postgresql database
product_promotion_df.to_sql(name='product_promotion', con=engine, if_exists='append', index=False)

### create customer_promotion table

In [60]:
#Make the promotion_response column boolean
df['response'] = df['response'].astype('bool')

In [61]:
# create customer_id 
customer_promotion_df = df[['customer_first_name','customer_last_name','birth_year', 'education', 'marital_status', 'income','numberof_children','enrollment_date', 'complain','deals','response']].drop_duplicates()
customer_promotion_df.insert(0, 'customer_id', range(1, 1 + len(customer_promotion_df)))
customer_promotion_df

,customer_id,customer_first_name,customer_last_name,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain,deals,response
0,1,Muhammed,Macintyre,1957,Graduation,Single,58138.0,0,2012-04-09,False,3,True
1,2,Barry,French,1954,Graduation,Single,46344.0,2,2014-08-03,False,2,False
2,3,Clay,Rozendal,1965,Graduation,Together,71613.0,0,2013-08-21,False,1,False
3,4,Carlos,Soltero,1984,Graduation,Together,26646.0,1,2014-10-02,False,2,False
4,5,Carl,Jackson,1981,PhD,Married,58293.0,1,2014-01-19,False,5,False
...,...,...,...,...,...,...,...,...,...,...,...,...
2235,2126,Alyson,Brown,1967,Graduation,Married,61223.0,1,2013-06-13,True,1,False
2236,2127,Jim,Epp,1946,PhD,Together,64014.0,3,2014-10-06,True,1,False
2237,2128,Jose,Mccloud,1981,Graduation,Divorced,56981.0,0,2014-01-25,True,1,True
2238,2129,Kingston,Vasquez,1956,Master,Together,69245.0,1,2014-01-24,True,4,True
2239,2130,Dylan,Walker,1954,PhD,Married,52869.0,2,2012-10-15,True,1,True

In [62]:
#merge customer_id into df
cp_temp = pd.merge(df,customer_promotion_df ,how='left',on=['customer_first_name','customer_last_name','birth_year','education', 'marital_status', 'income','numberof_children','enrollment_date','complain','deals','response'])
cp_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,birth_year,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,customer_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,1957,Graduation,Single,58138.0,0,2012-04-09,False,True,3,1
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,1954,Graduation,Single,46344.0,2,2014-08-03,False,False,2,2
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,1965,Graduation,Together,71613.0,0,2013-08-21,False,False,1,3
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,1984,Graduation,Together,26646.0,1,2014-10-02,False,False,2,4
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,1981,PhD,Married,58293.0,1,2014-01-19,False,False,5,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,1967,Graduation,Married,61223.0,1,2013-06-13,True,False,1,2126
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,1946,PhD,Together,64014.0,3,2014-10-06,True,False,1,2127
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,1981,Graduation,Divorced,56981.0,0,2014-01-25,True,True,1,2128
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,1956,Master,Together,69245.0,1,2014-01-24,True,True,4,2129
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,1954,PhD,Married,52869.0,2,2012-10-15,True,True,1,2130

In [63]:
# merge promotion_id into df
cp1_temp = pd.merge(cp_temp,promotion_df,how='left',on=['promotion_name'])
cp1_temp

,customer_first_name,customer_last_name,order_id,loyalty_level_name,loyalty_level,payment_method,payment_date,store_street_address,store_state,store_zipcode,...,education,marital_status,income,numberof_children,enrollment_date,complain,response,deals,customer_id,promotion_id
0,Muhammed,Macintyre,1,Bronze,3,credit card,2022-06-26,4 Union Square S,NY,10003,...,Graduation,Single,58138.0,0,2012-04-09,False,True,3,1,1
1,Barry,French,2,Bronze,3,venmo,2022-03-20,3720 Vision Dr,TX,76109,...,Graduation,Single,46344.0,2,2014-08-03,False,False,2,2,1
2,Clay,Rozendal,3,Bronze,3,venmo,2022-06-04,788 S Grand Ave,CA,90017,...,Graduation,Together,71613.0,0,2013-08-21,False,False,1,3,2
3,Carlos,Soltero,4,Bronze,3,cash,2022-01-04,5118 S Lake Park Ave,IL,60615,...,Graduation,Together,26646.0,1,2014-10-02,False,False,2,4,1
4,Carl,Jackson,5,Bronze,3,cash,2022-07-01,7930 SW 104th St,FL,33156,...,PhD,Married,58293.0,1,2014-01-19,False,False,5,5,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,Alyson,Brown,2236,Silver,2,credit card,2022-03-07,7930 SW 104th St,FL,33156,...,Graduation,Married,61223.0,1,2013-06-13,True,False,1,2126,2
2236,Jim,Epp,2237,Bronze,3,check,2022-07-08,7930 SW 104th St,FL,33156,...,PhD,Together,64014.0,3,2014-10-06,True,False,1,2127,5
2237,Jose,Mccloud,2238,Bronze,3,cash,2022-01-08,7930 SW 104th St,FL,33156,...,Graduation,Divorced,56981.0,0,2014-01-25,True,True,1,2128,1
2238,Kingston,Vasquez,2239,Bronze,3,debit card,2022-01-17,7930 SW 104th St,FL,33156,...,Master,Together,69245.0,1,2014-01-24,True,True,4,2129,3
2239,Dylan,Walker,2240,Bronze,3,credit card,2022-02-03,7930 SW 104th St,FL,33156,...,PhD,Married,52869.0,2,2012-10-15,True,True,1,2130,2

In [64]:
# Create temporary dataframe with unique customer_promotion
customer_promotion_df = cp1_temp[['promotion_id','customer_id','deals','response']].drop_duplicates()
#customer_promotion_df.head()
customer_promotion_df

      promotion_id  customer_id  deals  response
0                1            1      3      True
1                1            2      2     False
2                2            3      1     False
3                1            4      2     False
4                3            5      5     False
...            ...          ...    ...       ...
2235             2         2126      1     False
2236             5         2127      1     False
2237             1         2128      1      True
2238             3         2129      4      True
2239             2         2130      1      True

[2220 rows x 4 columns]

In [65]:
#Load customer_promotion data in the postgresql database
customer_promotion_df.to_sql(name='customer_promotion', con=engine, if_exists='append', index=False)

### Analtyical Procedures

In [66]:
# connect to database
conn = psycopg2.connect("dbname='group' host='localhost' user='postgres' password='2806218'")
cur = conn.cursor()

#### What is the average income of our most loyal (gold and silver) customers?

In [67]:
cmd1 = """
SELECT 
 cl.loyalty_level_name, 
 ROUND(avg(c.income),0) AS avg_income
FROM customers as c 
JOIN customer_loyalty cl USING (customer_loyalty_id) 
WHERE cl.loyalty_level_name = 'Gold' or cl.loyalty_level_name = 'Silver' 
GROUP BY cl.loyalty_level_name;
"""

In [68]:
result1 = connection.execute(cmd1).fetchall()

In [69]:
column_names = result1[0].keys()
result1=pd.DataFrame(result1, columns=column_names)
result1

  loyalty_level_name avg_income
0               Gold      52487
1             Silver      51817

#### Which campaign have the highest positive response?

In [70]:
cmd2 = """
SELECT 
p.promotion_name,
count(cp.response) AS positive_response 
FROM promotion p 
JOIN customer_promotion cp USING(promotion_id)
WHERE response ='True'
GROUP BY p.promotion_name
ORDER BY p.promotion_name DESC; 
"""

In [71]:
result2 = connection.execute(cmd2).fetchall()

In [72]:
column_names = result2[0].keys()
result2=pd.DataFrame(result2, columns=column_names)
result2

  promotion_name  positive_response
0     Campaign 5                130
1     Campaign 4                119
2     Campaign 3                148
3     Campaign 2                124
4     Campaign 1                132

#### Do parents complain more than nonparents?

In [73]:
cmd3 = """
SELECT 
COUNT(c.complain) AS numberof_complains,
CASE 
WHEN c.numberof_children = 0 THEN 'not parent'
ELSE 'parent'
END AS parent
FROM customers c
GROUP BY parent;
"""

In [74]:
result3 = connection.execute(cmd3).fetchall()

In [75]:
column_names = result3[0].keys()
result3=pd.DataFrame(result3, columns=column_names)
result3

   numberof_complains      parent
0                1531      parent
1                 599  not parent

#### How loyal are our customer base? How many customers are in each level?

In [76]:
cmd4 = """
SELECT 
count(customer_loyalty_id) AS numberof_customers,
loyalty_level_name 
FROM customer_loyalty as cl
JOIN customers c USING (customer_loyalty_id)
GROUP BY cl.loyalty_level_name;
"""

In [77]:
result4 = connection.execute(cmd4).fetchall()

In [78]:
column_names = result4[0].keys()
result4=pd.DataFrame(result4, columns=column_names)
result4

   numberof_customers loyalty_level_name
0                 196             Silver
1                 934             Bronze
2                1000               Gold

#### What is the education level of our customers?

In [79]:
cmd5 = """
SELECT 
count(customer_id) AS numberof_customers,
education 
FROM customers as c 
GROUP BY c.education
ORDER BY numberof_customers DESC;
"""

In [80]:
result5 = connection.execute(cmd5).fetchall()

In [81]:
column_names = result5[0].keys()
result5=pd.DataFrame(result5, columns=column_names)
result5

   numberof_customers   education
0                1078  Graduation
1                 459         PhD
2                 351      Master
3                 192    2n Cycle
4                  50       Basic

#### Are our customers satisfied with their experiences?

In [82]:
cmd6 = """
SELECT complain, 
count(complain) 
FROM customers c 
GROUP BY complain;
"""

In [83]:
result6 = connection.execute(cmd6).fetchall()

In [84]:
column_names = result6[0].keys()
result6=pd.DataFrame(result6, columns=column_names)
result6

   complain  count
0     False   1494
1      True    636

#### What are the most popular method of payments?

In [85]:
cmd7 = """
SELECT payment_method,
COUNT(payment_method) AS used
FROM payment_info 
GROUP BY payment_method 
ORDER BY count(payment_method) desc;
"""

In [86]:
result7 = connection.execute(cmd7).fetchall()

In [87]:
column_names = result7[0].keys()
result7=pd.DataFrame(result7, columns=column_names)
result7

  payment_method  used
0    credit card   719
1     debit card   409
2          venmo   380
3          check   371
4           cash   361

#### Which product is ordered the most?

In [88]:
cmd8 = """
SELECT p.product_type, 
COUNT(p.product_type) AS numberof_orders
FROM order_product op 
JOIN product p USING (product_id) 
GROUP BY p.product_type
ORDER BY numberof_orders DESC;
"""

In [89]:
result8 = connection.execute(cmd8).fetchall()

In [90]:
column_names = result8[0].keys()
result8=pd.DataFrame(result8, columns=column_names)
result8

  product_type  numberof_orders
0         Wine              474
1        Sweet              472
2       Fruits              443
3         Fish              429
4        Meats              422

#### Where do our customers shop at the most?

In [91]:
cmd9 = """
SELECT ol.store_street_address,
COUNT(ol.store_street_address) AS amount
FROM order_location ol 
GROUP BY ol.store_street_address
ORDER BY amount DESC;
"""

In [92]:
result9 = connection.execute(cmd9).fetchall()

In [93]:
column_names = result9[0].keys()
result9=pd.DataFrame(result9, columns=column_names)
result9

   store_street_address  amount
0        3720 Vision Dr     487
1       788 S Grand Ave     447
2  5118 S Lake Park Ave     443
3      7930 SW 104th St     433
4      4 Union Square S     430

#### Do gold members spend more on average than bronze and silver level members?

In [94]:
cmd10 = """
SELECT cl.loyalty_level_name, 
ROUND(avg(pi.payment_total),0) AS payment_total
FROM customer_loyalty as cl 
JOIN customers c ON cl.customer_loyalty_id = c.customer_loyalty_id 
JOIN customer_orders as co ON c.customer_id = co.customer_id 
JOIN payment_info as pi ON co.order_id = pi.order_id 
GROUP BY cl.loyalty_level_name
ORDER BY payment_total DESC;
"""

In [95]:
result10 = connection.execute(cmd10).fetchall()

In [96]:
column_names = result10[0].keys()
result10=pd.DataFrame(result10, columns=column_names)
result10

  loyalty_level_name payment_total
0               Gold           258
1             Silver           257
2             Bronze           255

#### What is our best selling product?

In [97]:
cmd11 = """
SELECT product_type, 
rank() over (order by total_cost desc) as rank 
FROM(SELECT product_id, product_type, unit_price*product_quantity as total_cost 
FROM product 
ORDER BY product_id) as best_product;
"""

In [98]:
result11 = connection.execute(cmd11).fetchall()

In [99]:
column_names = result11[0].keys()
result11=pd.DataFrame(result11, columns=column_names)
result11

  product_type  rank
0         Wine     1
1         Fish     2
2       Fruits     3
3        Meats     4
4        Sweet     5

#### What is the average age group of our customers?

In [100]:
cmd12 = """
SELECT
ROUND(avg(age),0)
FROM (SELECT 2022 - birth_year as age 
FROM customers) as customer_age;
"""

In [101]:
result12 = connection.execute(cmd12).fetchall()

In [102]:
column_names = result12[0].keys()
result12=pd.DataFrame(result12, columns=column_names)
result12

  round
0    53

#### What is the top states by the highest number of customer orders?

In [103]:
cmd13 = """
SELECT 
store_state,
COUNT(store_state) AS state
FROM order_location
GROUP BY store_state
ORDER BY state DESC;
"""

In [104]:
result13 = connection.execute(cmd13).fetchall()

In [105]:
column_names = result13[0].keys()
result13=pd.DataFrame(result13, columns=column_names)
result13

  store_state  state
0          TX    487
1          CA    447
2          IL    443
3          FL    433
4          NY    430

#### Do customers with a higher level of education use more deals than those with a lower education level?

In [106]:
cmd14 = """
SELECT c.education, 
count(cp.deals) AS numberof_customers
FROM customers c 
JOIN customer_promotion cp USING (customer_id) 
GROUP BY c.education 
ORDER BY numberof_customers desc;
"""

In [107]:
result14 = connection.execute(cmd14).fetchall()

In [108]:
column_names = result14[0].keys()
result14=pd.DataFrame(result14, columns=column_names)
result14

    education  numberof_customers
0  Graduation                1119
1         PhD                 481
2      Master                 364
3    2n Cycle                 202
4       Basic                  54

#### Which campaign should we use to target parents?

In [109]:
cmd15 = """
SELECT 
cp.response,
p.promotion_name,
COUNT(cp.response),
CASE 
WHEN c.numberof_children = 0 THEN 'not parent'
ELSE 'parent'
END AS parent
FROM customer_promotion cp
JOIN customers c USING (customer_id)
JOIN promotion p USING (promotion_id)
WHERE response = '1'
GROUP BY parent, cp.response,p.promotion_name
ORDER BY COUNT(cp.response) DESC;
"""

In [110]:
result15 = connection.execute(cmd15).fetchall()

In [111]:
column_names = result15[0].keys()
result15=pd.DataFrame(result15, columns=column_names)
result15

   response promotion_name  count      parent
0      True     Campaign 3    109      parent
1      True     Campaign 1     94      parent
2      True     Campaign 5     94      parent
3      True     Campaign 2     92      parent
4      True     Campaign 4     78      parent
5      True     Campaign 4     41  not parent
6      True     Campaign 3     39  not parent
7      True     Campaign 1     38  not parent
8      True     Campaign 5     36  not parent
9      True     Campaign 2     32  not parent

#### What is the total spend for parents vs non-parents?

In [112]:
cmd16 = """
SELECT 
 CASE 
 WHEN c.numberof_children = 0 THEN 'not parent'
 ELSE 'parent'
 END AS parent,
 ROUND(SUM(pi.payment_total),0) AS payment_total
FROM customers c
JOIN customer_orders as co ON c.customer_id = co.customer_id 
JOIN payment_info as pi ON co.order_id = pi.order_id 
GROUP BY parent
ORDER BY COUNT(pi.payment_total) DESC;
"""

In [113]:
result16 = connection.execute(cmd16).fetchall()

In [114]:
column_names = result16[0].keys()
result16=pd.DataFrame(result16, columns=column_names)
result16

       parent payment_total
0      parent        411829
1  not parent        163799

#### Which campaign do gold customers have the highest positive response?

In [115]:
cmd17 = """
SELECT p.promotion_name, 
count(cp.response), 
cp.response 
FROM customer_loyalty cl 
JOIN customers c USING (customer_loyalty_id) 
JOIN customer_promotion cp USING (customer_id) 
JOIN promotion p USING (promotion_id) 
WHERE cl.loyalty_level_name = 'Gold' AND cp.response ='1'
GROUP BY p.promotion_name,cp.response
ORDER BY cp.response, count(cp.response) DESC;
"""

In [116]:
result17 = connection.execute(cmd17).fetchall()

In [117]:
column_names = result17[0].keys()
result17=pd.DataFrame(result17, columns=column_names)
result17

  promotion_name  count  response
0     Campaign 1     60      True
1     Campaign 3     60      True
2     Campaign 5     58      True
3     Campaign 4     52      True
4     Campaign 2     50      True

#### How many orders are placed by each loyalty level?

In [118]:
cur.execute("CREATE VIEW loyalty_order AS SELECT co.order_id, cl.loyalty_level_name AS loyalty_level_order FROM customers c JOIN customer_orders co USING(customer_id) JOIN customer_loyalty cl USING(customer_loyalty_id); SELECT llo.loyalty_level_order, COUNT(llo.loyalty_level_order) AS total_orders  FROM loyalty_order llo JOIN order_product op USING(order_id) GROUP BY llo.loyalty_level_order ORDER BY total_orders DESC")           
print(cur.fetchall())

[('Gold', 1059), ('Bronze', 978), ('Silver', 203)]

# To drop tables, please change the two chunks below from 'Markdown' to 'Code' and Run

# drop tables 
query = """
DROP TABLE IF EXISTS customer_promotion;
DROP TABLE IF EXISTS product_promotion;
DROP TABLE IF EXISTS promotion_recipes;
DROP TABLE IF EXISTS promotion;
DROP TABLE IF EXISTS product_suppliers;
DROP TABLE IF EXISTS order_product;
DROP TABLE IF EXISTS product;
DROP TABLE IF EXISTS ref_department;
DROP TABLE IF EXISTS suppliers;
DROP TABLE IF EXISTS supplier_location;
DROP TABLE IF EXISTS supplier_representative;
DROP TABLE IF EXISTS payment_info;
DROP TABLE IF EXISTS shipment_status;
DROP TABLE IF EXISTS order_location;
DROP TABLE IF EXISTS customer_orders;
DROP TABLE IF EXISTS customers;
DROP TABLE IF EXISTS customer_loyalty;
"""

# close connection 
connection.execute(query)
connection.close()
print('Tables dropped successfully')